/*
 *  Copyright (C) 2016 Maxim Avilov (maxim.avilov@gmail.com)
 *
 *  This file is part of LiquidCrystal_I2C_Cyrillic.
 *
 *  LiquidCrystal_I2C_Cyrillic is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU Lesser Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  LiquidCrystal_I2C_Cyrillic is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU Lesser Public License for more details.
 *
 *  You should have received a copy of the GNU Lesser Public License
 *  along with LiquidCrystal_I2C_Cyrillic.  If not, see <http://www.gnu.org/licenses/>.
 *
 *  (Этот файл — часть LiquidCrystal_I2C_Cyrillic.
 *
 *  LiquidCrystal_I2C_Cyrillic - свободная программа: вы можете перераспространять ее и/или
 *  изменять ее на условиях Меньшей общественной лицензии GNU в том виде,
 *  в каком она была опубликована Фондом свободного программного обеспечения;
 *  либо версии 3 лицензии, либо (по вашему выбору) любой более поздней
 *  версии.
 *
 *  LiquidCrystal_I2C_Cyrillic распространяется в надежде, что она будет полезной,
 *  но БЕЗО ВСЯКИХ ГАРАНТИЙ; даже без неявной гарантии ТОВАРНОГО ВИДА
 *  или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Подробнее см. в Меньшей
 *  общественной лицензии GNU.
 *
 *  Вы должны были получить копию Меньшей общественной лицензии GNU
 *  вместе с этой программой. Если это не так, см.
 *  <http://www.gnu.org/licenses/>.)
 *
 * +++++++++++++[>+>+++++>+++++++++>++++++++>++>++++++<<<<<<-]>>.>.-.>.<-----.++
 * +.<-------.>>>++++++.>-.<<-------.<++++++.>++++++++.++++.>.<<<+++++++.>--.>--
 * --.+++.+++.<.<<---.
 */
#ifndef LC_Cyrillic_Font_Compact_h
#define LC_Cyrillic_Font_Compact_h
#include <avr/pgmspace.h>
#define CYRILLIC_FONT_CHAR_COUNT 0x2f
const PROGMEM uint8_t CyrFont[] = {
  //Б \x080
  0b11001100,0b10010010,0b10010010,0b10010010,0b11111110,
  //Г \x081
  0b11000000,0b10000000,0b10000000,0b10000000,0b11111110,
  //Ё \x082
  0b00000000,0b10100010,0b00101010,0b10101010,0b00111110,
  //Ж \x083
  0b11101110,0b00010000,0b11111110,0b00010000,0b11101110,
  //З \x084
  0b01101100,0b10010010,0b10010010,0b10010010,0b10000010,
  //И \x085
  0b11111110,0b00100000,0b00010000,0b00001000,0b11111110,
  //Й \x086
  0b00111110,0b10010000,0b01001000,0b10000100,0b00111110,
  //Л \x087
  0b11111110,0b10000000,0b11111100,0b10000010,0b00000100,
  //П \x088
  0b11111110,0b10000000,0b10000000,0b10000000,0b11111110,
  //У \x089
  0b11100000,0b00010000,0b00001000,0b00010100,0b11100010,
  //Ф \x08A
  0b00111000,0b01000100,0b11111110,0b01000100,0b00111000,
  //Ч\x08B
  0b11111110,0b00010000,0b00010000,0b00010000,0b11100000,
  //Ш \x08C
  0b11111110,0b00000010,0b11111110,0b00000010,0b11111110,
  //Ъ \x08D
  0b00001100,0b00010010,0b00010010,0b11111110,0b10000000,
  //Ы \x08E
  0b11111110,0b00000000,0b00001100,0b00010010,0b11111110,
  //Э \x08F
  0b01111100,0b10010010,0b10010010,0b10000010,0b01000100,
  //Ю \x090
  0b01111100,0b10000010,0b01101100,0b00010000,0b11111110,
  //Я \x091
  0b11111110,0b10010000,0b10011000,0b10010100,0b01100010,
  //б \x092
  0b10011100,0b10010010,0b01010010,0b01010010,0b00111100,
  //в \x093
  0b00000000,0b00010100,0b00101010,0b00101010,0b00111110,
  //г \x094
  0b00110000,0b00100000,0b00100000,0b00100000,0b00111110,
  //ё \x095
  0b00011000,0b10101010,0b00101010,0b10101010,0b00011100,
  //ж \x096
  0b00110110,0b00001000,0b00111110,0b00001000,0b00110110,
  //з \x097
  0b00010100,0b00101010,0b00101010,0b00101010,0b00100010,
  //и \x098
  0b00111110,0b00010000,0b00001000,0b00000100,0b00111110,
  //й \x099
  0b00011110,0b01001000,0b00100100,0b01000010,0b00011110,
  //к \x09A
  0b00000000,0b00100010,0b00010100,0b00001000,0b00111110,
  //л \x09B
  0b00111110,0b00100000,0b00111100,0b00100010,0b00000100,
  //м \x09C
  0b00111110,0b00010000,0b00001000,0b00010000,0b00111110,
  //н \x09D
  0b00111110,0b00001000,0b00001000,0b00001000,0b00111110,
  //п \x09E
  0b00111110,0b00100000,0b00100000,0b00100000,0b00111110,
  //т \x09F
  0b00100000,0b00100000,0b00111110,0b00100000,0b00100000,
  //ч \x0A0
  0b00111110,0b00001000,0b00001000,0b00001000,0b00110000,
  //ш \0xA1
  0b00111110,0b00000010,0b00111110,0b00000010,0b00111110,
  //ъ \x0A2
  0b00000100,0b00001010,0b00001010,0b00111110,0b00100000,
  //ы \x0A3
  0b00111110,0b00000000,0b00000100,0b00001010,0b00111110,
  //ь \x0A4
  0b00000000,0b00000100,0b00001010,0b00001010,0b00111110,
  //э \x0A5
  0b00111100,0b00101010,0b00101010,0b00100010,0b00010100,
  //ю \x0A6
  0b00011100,0b00100010,0b00011100,0b00001000,0b00111110,
  //я \x0A7
  0b00111110,0b00101000,0b00101100,0b00101010,0b00010000,
  //Д \x0A8
  0b11111111,0b10000010,0b11110010,0b10001010,0b00000111,
  //Ц \x0A9
  0b11111111,0b00000010,0b00000010,0b00000010,0b11111110,
  //Щ \x0AA
  0b11111111,0b00000010,0b11111110,0b00000010,0b11111110,
  //д \x0AB
  0b00111111,0b00100010,0b00110010,0b00101010,0b00000111,
  //ф \x0AC
  0b00001100,0b00010010,0b01111111,0b00010010,0b00001100,
  //ц \x0AD
  0b00111111,0b00000010,0b00000010,0b00000010,0b00111110,
  //щ \x0AE
  0b00111111,0b00000010,0b00111110,0b00000010,0b00111110};
  
#endif